# Application Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RibbonItemEventArgs..::..Application Property
RibbonItemEventArgs Class See Also
---
The current UIApplication.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UIApplication Application { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Application As UIApplication
	Get
```

Visual C++
---
```text
public:
property UIApplication^ Application {
	UIApplication^ get ();
}
```

# See Also
RibbonItemEventArgs Class
Autodesk.Revit.UI.Events Namespace